{
  "name": "Cliick.io (Backend Ready) (Nov 18/ 2:30PM)",
  "description": "An AI-powered assistant and management platform for online shops, featuring conversational commerce, inventory management, and marketing tools.\n\n1/ All Previous Completed \n2/ Code Cleaning Process\na/ HR Code Cleaning Done. \nb/ onUpdateShop, itemID duplication and service order flow missing part updated. \n\n3/ Clean the UI to be more organized. Chat Assistant is with New UI. \n\n4/ item Editor Modal Updated and UI/UX for item editor are now super. \n\n5/ Automated Actions updated, persistant menu updated, persistent button updated \n6/ Automated Conversion Flow name changed and UI changed, toogle on/off sync with quick replies and automation rul's actions. \n\n7/ T&C privacy policy added in singup form. \n\n8/ Cliick logo and font updated. \n\n9/ Code cleaned again\n\n10/ AI Response Error Solved, Product Description Linked to the More Info.  \n\n11/ item Editor Layout and Ai's char issue solved. And AI phohto Studio and AI description generator's control are in admin dashboard now. \n\n12/ Admin Dashboard - Shop Management Completed. Overvie dasshboard completed\n\n13/ Commercialization Steps\na/ Centralized API file done. \nb/ Polished the Automoation UI\nc/ Assistant response silent solved. \nd/ AI Assistant Prveiw Exp solved, Localization for sale assistant solved. \ne/ conversation commerce logics and admin control setting done. Some minor changes in Product Cards's buttoons. \nf/ API Service & AI Service centralized, and admin dashboard also included the API & Model Configuration, but not stable yet. \n\ng/ item Editor \"Order Now\" Field replaced with action buttons\nh/ added \"More Details' Dynamic button.\n\ni/ basic inventory managment, product ledget, bulk stock adjustment added. \n\n\n13/ Final version before Majoir Change for more platforms. IG & FB Ready. \n\n14/ Subscription Panel WIP-Mostly worked apart from Advanced sale dashbaord. Fully Worked and HR Panel Removed\n\n15/  and manual status put in offline sale Done\n\n16/ Receipt don, setting error done. \n\n17/ Quick Replies logic done. \n\n18/ Marketing Assistant Completely Cleaned\n\n19/ Code Cleaning, Team Management Logic WIP, \nneed to clean mockup data and set preset, and then go for the production stages. \n\n20/Cleanded Root Files. \n\n21/ App Logics and Code revised to be more simple. \n\n22/ admin dashboard and app become monoholic\n\n23/ item editor modal issue solved. \n\n24/ Localization Solving\n\n25/ Inbox Enhanced and now with better expeirience and save replies. \n\n26/Payment Intelligent Deployed\n\n27/ Cleaned Code: Inbox Polished, save replied polished. \n\n28/ Logo updated, all tranlsation file 90% good. \n\n29/ Refining the language barrier and simplying the language and chatlogic\n\n30/ Add More primary language\n\n31/ Quick Replies Architecture Shift, 90% finished, jsut to discuss custom button creation. \n\n31/ Button Editor Done. \n\n32/ Bilanguagl Done, miimic remved, error in Payment Intelligent System. Making Quick Replies Button Smarter\n\n33/ Payment Intelligent System Solved and working perfectly and PIS reply customization added.\n\n34/ Physical Store and Logics for online/offline physical sstore updated. \n\n35/ Subscription Plan Changing / Changing WIP 90% Finished. \nWIP -Admin Pane> Setting of text control of subscripton to update growth plan\n\n36/ Multicurrency support to make - Done in Admin Dashboard as well - Done\n\n37/ Subscription Page, Instant Upgrade Commit Override Error, Solved\n\n38/ Now we got the perfect Login Page with perfect animation \n\n\nN/ WIP Polishing Operatin/ Local Language, need to discuss about Subscription Plan and update it in the subscripont plan, then go for the production stage. ",
  "requestFramePermissions": []
}